nxp-mcuxpresso/mcux-soc-svd/LPC5514/LPC5514.xml
        <register>
          <name>DCDC1</name>
          <description>DCDC (second) control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1803A98</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTRIMOFFET</name>
              <description>Adjust the offset voltage of BJT based comparator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSENSETRIM</name>
              <description>Adjust Max inductor peak current limiting.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTESTENABLE</name>
              <description>Enable Digital test signals.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETCURVE</name>
              <description>Bandgap calibration parameter.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETDC</name>
              <description>Bandgap calibration parameter.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTESTSEL</name>
              <description>Select the output signal for test.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISCALEENABLE</name>
              <description>Modify COT behavior.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEBYPASS</name>
              <description>Force bypass mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMAUTOCOT</name>
              <description>Change the scaling ratio of the feedforward compensation.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEFULLCYCLE</name>
              <description>Force full PFM PMOS and NMOS cycle.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCENABLE</name>
              <description>Change the range of the peak detector of current inside the inductor.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOFF</name>
              <description>Constant Off-Time calibration input.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOFFENABLE</name>
              <description>Enable Constant Off-Time feature.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOPMU</name>
          <description>Power Management Unit (PMU) and Always-On domains LDO control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10EF718</resetValue>
          <resetMask>0x31FFFFF</resetMask>
          <fields>
            <field>
              <name>VADJ</name>
              <description>Sets the Always-On domain LDO output level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_1P220</name>
                  <description>1.22 V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P700</name>
                  <description>0.7 V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P725</name>
                  <description>0.725 V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P750</name>
                  <description>0.75 V.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P775</name>
                  <description>0.775 V.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P800</name>
                  <description>0.8 V.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P825</name>
                  <description>0.825 V.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P850</name>
                  <description>0.85 V.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P875</name>
                  <description>0.875 V.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P900</name>
                  <description>0.9 V.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P960</name>
                  <description>0.96 V.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P970</name>
                  <description>0.97 V.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P980</name>
                  <description>0.98 V.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P990</name>
                  <description>0.99 V.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P000</name>
                  <description>1 V.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P010</name>
                  <description>1.01 V.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P020</name>
                  <description>1.02 V.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P030</name>
                  <description>1.03 V.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P040</name>
                  <description>1.04 V.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P050</name>
                  <description>1.05 V.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P060</name>
                  <description>1.06 V.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P070</name>
                  <description>1.07 V.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P080</name>
                  <description>1.08 V.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P090</name>
                  <description>1.09 V.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P100</name>
                  <description>1.1 V.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P110</name>
                  <description>1.11 V.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P120</name>
                  <description>1.12 V.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P130</name>
                  <description>1.13 V.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P140</name>
                  <description>1.14 V.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P150</name>
                  <description>1.15 V.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P160</name>
                  <description>1.16 V.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P220_1</name>
                  <description>1.22 V.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADJ_PWD</name>
              <description>Sets the Always-On domain LDO output level in all power down modes.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADJ_BOOST</name>
              <description>Sets the Always-On domain LDO Boost output level.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADJ_BOOST_PWD</name>
              <description>Sets the Always-On domain LDO Boost output level in all power down modes.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEED</name>
              <description>Controls LDOMEM bleed current.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Bleed current is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Bleed current is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOST_ENA</name>
              <description>Control the LDO AO boost mode in ACTIVE mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LDO AO Boost Mode is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>LDO AO Boost Mode is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOST_ENA_PWD</name>
              <description>Control the LDO AO boost mode in the different low power modes (DEEP SLEEP, POWERDOWN, and DEEP POWER DOWN).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LDO AO Boost Mode is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>LDO AO Boost Mode is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BODVBAT</name>
          <description>VBAT Brown Out Dectector (BoD) control register [Reset by: PoR, Pin Reset, Software Reset]</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x47</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>TRIGLVL</name>
              <description>BoD trigger level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_1P00</name>
                  <description>1.00 V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P10</name>
                  <description>1.10 V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P20</name>
                  <description>1.20 V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P30</name>
                  <description>1.30 V.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P40</name>
                  <description>1.40 V.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P50</name>
                  <description>1.50 V.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P60</name>
                  <description>1.60 V.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P65</name>
                  <description>1.65 V.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P70</name>
                  <description>1.70 V.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P75</name>
                  <description>1.75 V.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P80</name>
                  <description>1.80 V.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P90</name>
                  <description>1.90 V.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P00</name>
                  <description>2.00 V.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P10</name>
                  <description>2.10 V.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P20</name>
                  <description>2.20 V.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P30</name>
                  <description>2.30 V.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P40</name>
                  <description>2.40 V.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P50</name>
                  <description>2.50 V.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P60</name>
                  <description>2.60 V.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P70</name>
                  <description>2.70 V.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P80</name>
                  <description>2.806 V.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P90</name>
                  <description>2.90 V.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P00</name>
                  <description>3.00 V.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P10</name>
                  <description>3.10 V.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P20</name>
                  <description>3.20 V.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P30_2</name>
                  <description>3.30 V.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P30_3</name>
                  <description>3.30 V.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P30_4</name>
                  <description>3.30 V.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P30_5</name>
                  <description>3.30 V.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P30_6</name>
                  <description>3.30 V.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P30_7</name>
                  <description>3.30 V.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P30_8</name>
                  <description>3.30 V.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>BoD Hysteresis control.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYST_25MV</name>
                  <description>25 mV.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_50MV</name>
                  <description>50 mV.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_75MV</name>
                  <description>75 mV.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_100MV</name>
                  <description>100 mV.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
