nxp-mcuxpresso/mcux-soc-svd/LPC5514/LPC5514.xml
        <register>
          <name>PWD_TOG</name>
          <description>USB PHY Power-Down Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1E1C00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPWDFS</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of CTRL is enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Power-down the USB full-speed drivers. This turns off the current starvation sources and puts the</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPWDIBIAS</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of CTRL is enabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Power-down the USB PHY current bias block for the transmitter. This bit should be set only when the</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPWDV2I</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of CTRL is enabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Power-down the USB PHY transmit V-to-I converter and the current mirror</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWDENV</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of CTRL is enabled</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Power-down the USB high-speed receiver envelope detector (squelch signal)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWD1PT1</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of CTRL is enabled</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Power-down the USB full-speed differential receiver.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWDDIFF</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of CTRL is enabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Power-down the USB high-speed differential receive</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWDRX</name>
              <description>This bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of CTRL is enabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Power-down the entire USB PHY receiver block except for the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TX</name>
          <description>USB PHY Transmitter Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>Decode to trim the nominal 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Maximum current, approximately 19% above nominal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Nominal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value15</name>
                  <description>Minimum current, approximately 19% below nominal.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DM</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DM output pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DN</name>
              <description>Enable resistance calibration on DN.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DP output pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DP</name>
              <description>Enable resistance calibration on DP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_SET</name>
          <description>USB PHY Transmitter Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>Decode to trim the nominal 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Maximum current, approximately 19% above nominal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Nominal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value15</name>
                  <description>Minimum current, approximately 19% below nominal.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DM</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DM output pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DN</name>
              <description>Enable resistance calibration on DN.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DP output pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DP</name>
              <description>Enable resistance calibration on DP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CLR</name>
          <description>USB PHY Transmitter Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>Decode to trim the nominal 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Maximum current, approximately 19% above nominal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Nominal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value15</name>
                  <description>Minimum current, approximately 19% below nominal.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DM</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DM output pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DN</name>
              <description>Enable resistance calibration on DN.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DP output pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DP</name>
              <description>Enable resistance calibration on DP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_TOG</name>
          <description>USB PHY Transmitter Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>Decode to trim the nominal 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Maximum current, approximately 19% above nominal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Nominal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value15</name>
                  <description>Minimum current, approximately 19% below nominal.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DM</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DM output pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DN</name>
              <description>Enable resistance calibration on DN.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DP output pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENCAL45DP</name>
              <description>Enable resistance calibration on DP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX</name>
          <description>USB PHY Receiver Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>The DISCONADJ field adjusts the trip point for the disconnect detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Trip-Level Voltage is 0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Trip-Level Voltage is 0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Trip-Level Voltage is 0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Trip-Level Voltage is 0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
