nxp-mcuxpresso/mcux-soc-svd/LPC5514/LPC5514.xml
        <register>
          <name>PCFG11</name>
          <description>Configuration register 1 for channel pair</description>
          <addressOffset>0xC20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x401</resetMask>
          <fields>
            <field>
              <name>PAIRENABLE</name>
              <description>Enable for this channel pair.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>This I2S channel pair is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>This I2S channel pair is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONECHANNEL</name>
              <description>Single channel mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>I2S data for this channel pair is treated as left and right channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>I2S data for this channel pair is treated as a single channel, functionally the left channel for this pair.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCFG21</name>
          <description>Configuration register 2 for channel pair</description>
          <addressOffset>0xC24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FF0000</resetMask>
          <fields>
            <field>
              <name>POSITION</name>
              <description>Data Position.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSTAT1</name>
          <description>Status register for channel pair</description>
          <addressOffset>0xC28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy status for this channel pair.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>The transmitter/receiver for this channel pair is currently idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROCESSING</name>
                  <description>The transmitter/receiver for this channel pair is currently processing data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLVFRMERR</name>
              <description>Save Frame Error flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LR</name>
              <description>Left/Right indication.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAPAUSED</name>
              <description>Data Paused status flag.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>Data is not currently paused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE</name>
                  <description>A data pause has been requested and is now in force.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCFG12</name>
          <description>Configuration register 1 for channel pair</description>
          <addressOffset>0xC40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x401</resetMask>
          <fields>
            <field>
              <name>PAIRENABLE</name>
              <description>Enable for this channel pair.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>This I2S channel pair is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>This I2S channel pair is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONECHANNEL</name>
              <description>Single channel mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>I2S data for this channel pair is treated as left and right channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>I2S data for this channel pair is treated as a single channel, functionally the left channel for this pair.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCFG22</name>
          <description>Configuration register 2 for channel pair</description>
          <addressOffset>0xC44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FF0000</resetMask>
          <fields>
            <field>
              <name>POSITION</name>
              <description>Data Position.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSTAT2</name>
          <description>Status register for channel pair</description>
          <addressOffset>0xC48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy status for this channel pair.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>The transmitter/receiver for this channel pair is currently idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROCESSING</name>
                  <description>The transmitter/receiver for this channel pair is currently processing data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLVFRMERR</name>
              <description>Save Frame Error flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LR</name>
              <description>Left/Right indication.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAPAUSED</name>
              <description>Data Paused status flag.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>Data is not currently paused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE</name>
                  <description>A data pause has been requested and is now in force.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCFG13</name>
          <description>Configuration register 1 for channel pair</description>
          <addressOffset>0xC60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x401</resetMask>
          <fields>
            <field>
              <name>PAIRENABLE</name>
              <description>Enable for this channel pair.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>This I2S channel pair is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>This I2S channel pair is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONECHANNEL</name>
              <description>Single channel mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>I2S data for this channel pair is treated as left and right channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>I2S data for this channel pair is treated as a single channel, functionally the left channel for this pair.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCFG23</name>
          <description>Configuration register 2 for channel pair</description>
          <addressOffset>0xC64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FF0000</resetMask>
          <fields>
            <field>
              <name>POSITION</name>
              <description>Data Position.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSTAT3</name>
          <description>Status register for channel pair</description>
          <addressOffset>0xC68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy status for this channel pair.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>The transmitter/receiver for this channel pair is currently idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROCESSING</name>
                  <description>The transmitter/receiver for this channel pair is currently processing data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLVFRMERR</name>
              <description>Save Frame Error flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LR</name>
              <description>Left/Right indication.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAPAUSED</name>
              <description>Data Paused status flag.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>Data is not currently paused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE</name>
                  <description>A data pause has been requested and is now in force.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
