nxp-mcuxpresso/mcux-soc-svd/LPC5514/LPC5514.xml
        <register>
          <name>STAT</name>
          <description>ADC Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDY0</name>
              <description>Result FIFO 0 Ready Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY0_0</name>
                  <description>Result FIFO 0 data level not above watermark level.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY0_1</name>
                  <description>Result FIFO 0 holding data above watermark level.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOF0</name>
              <description>Result FIFO 0 Overflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FOF0_0</name>
                  <description>No result FIFO 0 overflow has occurred since the last time the flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOF0_1</name>
                  <description>At least one result FIFO 0 overflow has occurred since the last time the flag was cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY1</name>
              <description>Result FIFO1 Ready Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY1_0</name>
                  <description>Result FIFO1 data level not above watermark level.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY1_1</name>
                  <description>Result FIFO1 holding data above watermark level.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOF1</name>
              <description>Result FIFO1 Overflow Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FOF1_0</name>
                  <description>No result FIFO1 overflow has occurred since the last time the flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOF1_1</name>
                  <description>At least one result FIFO1 overflow has occurred since the last time the flag was cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEXC_INT</name>
              <description>Interrupt Flag For High Priority Trigger Exception</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEXC_INT_0</name>
                  <description>No trigger exceptions have occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEXC_INT_1</name>
                  <description>A trigger exception has occurred and is pending acknowledgement.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_INT</name>
              <description>Interrupt Flag For Trigger Completion</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCOMP_INT_0</name>
                  <description>Either IE[TCOMP_IE] is set to 0, or no trigger sequences have run to completion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCOMP_INT_1</name>
                  <description>Trigger sequence has been completed and all data is stored in the associated FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAL_RDY</name>
              <description>Calibration Ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAL_RDY_0</name>
                  <description>Calibration is incomplete or hasn't been ran.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAL_RDY_1</name>
                  <description>The ADC is calibrated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_ACTIVE</name>
              <description>ADC Active</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_ACTIVE_0</name>
                  <description>The ADC is IDLE. There are no pending triggers to service and no active commands are being processed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_ACTIVE_1</name>
                  <description>The ADC is processing a conversion, running through the power up delay, or servicing a trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGACT</name>
              <description>Trigger Active</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRGACT_0</name>
                  <description>Command (sequence) associated with Trigger 0 currently being executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_1</name>
                  <description>Command (sequence) associated with Trigger 1 currently being executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_2</name>
                  <description>Command (sequence) associated with Trigger 2 currently being executed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_3</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_4</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_5</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_6</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_7</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_8</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_9</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_10</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_11</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_12</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_13</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_14</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGACT_15</name>
                  <description>Command (sequence) from the associated Trigger number is currently being executed.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDACT</name>
              <description>Command Active</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMDACT_0</name>
                  <description>No command is currently in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_1</name>
                  <description>Command 1 currently being executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_2</name>
                  <description>Command 2 currently being executed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_3</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_4</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_5</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_6</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_7</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_8</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_9</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_10</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_11</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_12</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_13</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_14</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDACT_15</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
